gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/inc/hw_epwmxbar.h
//*****************************************************************************
//
// The following are defines for the bit fields in the TRIP8MUXENABLE register
//
//*****************************************************************************
#define XBAR_TRIP8MUXENABLE_MUX0  0x1U        // mux0 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX1  0x2U        // Mux1 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX2  0x4U        // Mux2 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX3  0x8U        // Mux3 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX4  0x10U       // Mux4 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX5  0x20U       // Mux5 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX6  0x40U       // Mux6 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX7  0x80U       // Mux7 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX8  0x100U      // Mux8 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX9  0x200U      // Mux9 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX10  0x400U      // Mux10 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX11  0x800U      // Mux11 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX12  0x1000U     // Mux12 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX13  0x2000U     // Mux13 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX14  0x4000U     // Mux14 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX15  0x8000U     // Mux15 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX16  0x10000U    // Mux16 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX17  0x20000U    // Mux17 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX18  0x40000U    // Mux18 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX19  0x80000U    // Mux19 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX20  0x100000U   // Mux20 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX21  0x200000U   // Mux21 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX22  0x400000U   // Mux22 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX23  0x800000U   // Mux23 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX24  0x1000000U  // Mux24 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX25  0x2000000U  // Mux25 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX26  0x4000000U  // Mux26 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX27  0x8000000U  // Mux27 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX28  0x10000000U // Mux28 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX29  0x20000000U // Mux29 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX30  0x40000000U // Mux30 to drive TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIP8MUXENABLE_MUX31  0x80000000U // Mux31 to drive TRIP8 of
                                              // EPWM-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the TRIP9MUXENABLE register
//
//*****************************************************************************
#define XBAR_TRIP9MUXENABLE_MUX0  0x1U        // mux0 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX1  0x2U        // Mux1 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX2  0x4U        // Mux2 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX3  0x8U        // Mux3 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX4  0x10U       // Mux4 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX5  0x20U       // Mux5 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX6  0x40U       // Mux6 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX7  0x80U       // Mux7 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX8  0x100U      // Mux8 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX9  0x200U      // Mux9 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX10  0x400U      // Mux10 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX11  0x800U      // Mux11 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX12  0x1000U     // Mux12 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX13  0x2000U     // Mux13 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX14  0x4000U     // Mux14 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX15  0x8000U     // Mux15 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX16  0x10000U    // Mux16 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX17  0x20000U    // Mux17 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX18  0x40000U    // Mux18 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX19  0x80000U    // Mux19 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX20  0x100000U   // Mux20 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX21  0x200000U   // Mux21 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX22  0x400000U   // Mux22 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX23  0x800000U   // Mux23 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX24  0x1000000U  // Mux24 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX25  0x2000000U  // Mux25 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX26  0x4000000U  // Mux26 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX27  0x8000000U  // Mux27 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX28  0x10000000U // Mux28 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX29  0x20000000U // Mux29 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX30  0x40000000U // Mux30 to drive TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIP9MUXENABLE_MUX31  0x80000000U // Mux31 to drive TRIP9 of
                                              // EPWM-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the TRIP10MUXENABLE register
//
//*****************************************************************************
#define XBAR_TRIP10MUXENABLE_MUX0  0x1U        // mux0 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX1  0x2U        // Mux1 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX2  0x4U        // Mux2 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX3  0x8U        // Mux3 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX4  0x10U       // Mux4 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX5  0x20U       // Mux5 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX6  0x40U       // Mux6 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX7  0x80U       // Mux7 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX8  0x100U      // Mux8 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX9  0x200U      // Mux9 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX10  0x400U      // Mux10 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX11  0x800U      // Mux11 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX12  0x1000U     // Mux12 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX13  0x2000U     // Mux13 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX14  0x4000U     // Mux14 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX15  0x8000U     // Mux15 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX16  0x10000U    // Mux16 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX17  0x20000U    // Mux17 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX18  0x40000U    // Mux18 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX19  0x80000U    // Mux19 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX20  0x100000U   // Mux20 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX21  0x200000U   // Mux21 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX22  0x400000U   // Mux22 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX23  0x800000U   // Mux23 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX24  0x1000000U  // Mux24 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX25  0x2000000U  // Mux25 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX26  0x4000000U  // Mux26 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX27  0x8000000U  // Mux27 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX28  0x10000000U // Mux28 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX29  0x20000000U // Mux29 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX30  0x40000000U // Mux30 to drive TRIP10 of
                                              // EPWM-XBAR
#define XBAR_TRIP10MUXENABLE_MUX31  0x80000000U // Mux31 to drive TRIP10 of
                                              // EPWM-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the TRIP11MUXENABLE register
//
//*****************************************************************************
#define XBAR_TRIP11MUXENABLE_MUX0  0x1U        // mux0 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX1  0x2U        // Mux1 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX2  0x4U        // Mux2 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX3  0x8U        // Mux3 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX4  0x10U       // Mux4 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX5  0x20U       // Mux5 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX6  0x40U       // Mux6 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX7  0x80U       // Mux7 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX8  0x100U      // Mux8 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX9  0x200U      // Mux9 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX10  0x400U      // Mux10 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX11  0x800U      // Mux11 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX12  0x1000U     // Mux12 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX13  0x2000U     // Mux13 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX14  0x4000U     // Mux14 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX15  0x8000U     // Mux15 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX16  0x10000U    // Mux16 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX17  0x20000U    // Mux17 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX18  0x40000U    // Mux18 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX19  0x80000U    // Mux19 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX20  0x100000U   // Mux20 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX21  0x200000U   // Mux21 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX22  0x400000U   // Mux22 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX23  0x800000U   // Mux23 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX24  0x1000000U  // Mux24 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX25  0x2000000U  // Mux25 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX26  0x4000000U  // Mux26 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX27  0x8000000U  // Mux27 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX28  0x10000000U // Mux28 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX29  0x20000000U // Mux29 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX30  0x40000000U // Mux30 to drive TRIP11 of
                                              // EPWM-XBAR
#define XBAR_TRIP11MUXENABLE_MUX31  0x80000000U // Mux31 to drive TRIP11 of
                                              // EPWM-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the TRIP12MUXENABLE register
//
//*****************************************************************************
#define XBAR_TRIP12MUXENABLE_MUX0  0x1U        // mux0 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX1  0x2U        // Mux1 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX2  0x4U        // Mux2 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX3  0x8U        // Mux3 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX4  0x10U       // Mux4 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX5  0x20U       // Mux5 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX6  0x40U       // Mux6 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX7  0x80U       // Mux7 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX8  0x100U      // Mux8 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX9  0x200U      // Mux9 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX10  0x400U      // Mux10 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX11  0x800U      // Mux11 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX12  0x1000U     // Mux12 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX13  0x2000U     // Mux13 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX14  0x4000U     // Mux14 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX15  0x8000U     // Mux15 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX16  0x10000U    // Mux16 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX17  0x20000U    // Mux17 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX18  0x40000U    // Mux18 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX19  0x80000U    // Mux19 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX20  0x100000U   // Mux20 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX21  0x200000U   // Mux21 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX22  0x400000U   // Mux22 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX23  0x800000U   // Mux23 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX24  0x1000000U  // Mux24 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX25  0x2000000U  // Mux25 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX26  0x4000000U  // Mux26 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX27  0x8000000U  // Mux27 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX28  0x10000000U // Mux28 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX29  0x20000000U // Mux29 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX30  0x40000000U // Mux30 to drive TRIP12 of
                                              // EPWM-XBAR
#define XBAR_TRIP12MUXENABLE_MUX31  0x80000000U // Mux31 to drive TRIP12 of
                                              // EPWM-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the TRIPOUTINV register
//
//*****************************************************************************
#define XBAR_TRIPOUTINV_OUT0      0x1U        // Selects polarity for TRIP4 of
                                              // EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT1      0x2U        // Selects polarity for TRIP5 of
                                              // EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT2      0x4U        // Selects polarity for TRIP7 of
                                              // EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT3      0x8U        // Selects polarity for TRIP8 of
                                              // EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT4      0x10U       // Selects polarity for TRIP9 of
                                              // EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT5      0x20U       // Selects polarity for TRIP10
                                              // of EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT6      0x40U       // Selects polarity for TRIP11
                                              // of EPWM-XBAR
#define XBAR_TRIPOUTINV_OUT7      0x80U       // Selects polarity for TRIP12
                                              // of EPWM-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the TRIPLOCK register
//
//*****************************************************************************
#define XBAR_TRIPLOCK_LOCK        0x1U        // Locks the configuration for
                                              // EPWM-XBAR
#define XBAR_TRIPLOCK_KEY_S       16U
#define XBAR_TRIPLOCK_KEY_M       0xFFFF0000U // Write protection KEY
#endif
